**MAESTRÍA EN INTELIGENCIA ARTIFICIAL APLICADA**

**Curso: TC4029 - Ciencia y analítica de datos**

Tecnológico de Monterrey

Prof Grettel Barceló Alonso

**Semana 3**
Bases, almacenes y manipulación de datos

---

*   NOMBRE: Antonio Olvera Donlucas 
*   MATRÍCULA: A01795617

---

En esta actividad usarás la base de datos relacional `classicmodels` (MySQL), compuesta por las siguientes tablas:

*   `Customers`: almacena los datos de los clientes.
*   `Products`: almacena una lista de modelos de coches a escala.
*   `ProductLines`: almacena una lista de categorías de líneas de productos.
*   `Orders`: almacena los pedidos de venta realizados por los clientes.
*   `OrderDetails`: almacena elementos de línea de pedidos de ventas para cada pedido de ventas.
*   `Payments`: almacena los pagos realizados por los clientes en función de sus cuentas.
*   `Employees`: almacena toda la información de los empleados, así como la estructura de la organización, como quién informa a quién.
*   `Offices`: almacena los datos de la oficina de ventas.

Revisa con detalle su esquema para que comprendas cómo se relacionan las tablas anteriores.

Recuerda que:


*   Una **clave primaria** es un atributo (o conjunto) que identifica unívocamente a cada registro en la tabla.
*   Una **clave foránea** (externa o ajena) es un atributos (o conjunto) en una tabla que es una clave primaria en otra (o posiblemente la misma) tabla.
*   Las **relaciones** son las líneas que conectan una tabla con otra y el extremo determina la cardinalidad. Las relaciones con línea continua (identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser foránea y primaria (al mismo tiempo) de otra. Las relaciones con línea discontinua (no identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser sólo foránea en otra.

# **Parte 1**. SQLAlchemy y SQL básico

In [28]:
import sqlalchemy as sqla
import pymysql
import pandas as pd

1.	Crea el motor `sqlalchemy`, con el método `create_engine()` y una conexión con `connect()` como se muestra a continuación:

In [29]:
# Crear el motor (dialecto://usuarioBD:clave@ipHostDBMS:puerto/esquema
db = sqla.create_engine('mysql+pymysql://mnaTC4029User:mnaTC4029Pass!@20.106.157.52:3306/classicmodels', pool_recycle=3600)

# Crea una conexión para luego invocar declaraciones SQL
conn = db.connect()

Escribe las consultas en SQL para obtener:

2.	La información de las líneas de productos.

In [30]:

query = "SELECT productLine as Líneas_de_producto, textDescription as Descripción  FROM productlines"

pd.read_sql(query,db)

  Líneas_de_producto                                        Descripción
0       Classic Cars  Attention car enthusiasts: Make your wildest c...
1        Motorcycles  Our motorcycles are state of the art replicas ...
2             Planes  Unique, diecast airplane and helicopter replic...
3              Ships  The perfect holiday or anniversary gift for ex...
4             Trains  Model trains are a rewarding hobby for enthusi...
5   Trucks and Buses  The Truck and Bus models are realistic replica...
6       Vintage Cars  Our Vintage Car models realistically portray a...

3.	Los empleados ordenados por nombre (`firstName`).

In [31]:
query = "SELECT CONCAT(firstName, ' ', lastName) AS Nombre, jobTitle as Puesto, employeeNumber as Número_empleado  FROM employees order by firstName"

pd.read_sql(query,db)

               Nombre                Puesto  Número_empleado
0         Andy Fixter             Sales Rep             1611
1         Anthony Bow    Sales Manager (NA)             1143
2         Barry Jones             Sales Rep             1504
3        Diane Murphy             President             1002
4      Foon Yue Tseng             Sales Rep             1286
5       George Vanauf             Sales Rep             1323
6       Gerard Bondur   Sale Manager (EMEA)             1102
7    Gerard Hernandez             Sales Rep             1370
8       Jeff Firrelli          VP Marketing             1076
9      Julie Firrelli             Sales Rep             1188
10         Larry Bott             Sales Rep             1501
11    Leslie Jennings             Sales Rep             1165
12    Leslie Thompson             Sales Rep             1166
13        Loui Bondur             Sales Rep             1337
14         Mami Nishi             Sales Rep             1621
15      Martin Gerard             Sales Rep             1702
16     Mary Patterson              VP Sales             1056
17    Pamela Castillo             Sales Rep             1401
18        Peter Marsh             Sales Rep             1612
19    Steve Patterson             Sales Rep             1216
20           Tom King             Sales Rep             1619
21  William Patterson  Sales Manager (APAC)             1088
22       Yoshimi Kato             Sales Rep             1625

4.	Los países donde hay oficinas.

In [32]:
query = "SELECT country as País, count(officeCode) as Oficinas FROM offices GROUP BY country ORDER BY Oficinas desc "

pd.read_sql(query,db)

        País  Oficinas
0        USA         3
1  Australia         1
2         UK         1
3     France         1
4      Japan         1

5.	El nombre y teléfono de los clientes de la ciudad de Nueva York (*NYC*).

In [33]:
query = "SELECT customerName AS Cliente, CONCAT(contactFirstName, ' ', contactLastName) AS Contacto, phone as Teléfono FROM customers where city LIKE '%%NYC%%'"
pd.read_sql(query,db)

                Cliente         Contacto    Teléfono
0     Land of Toys Inc.         Kwai Lee  2125557818
1    Muscle Machine Inc       Jeff Young  2125557413
2       Vitachrome Inc.    Michael Frick  2125551500
3  Classic Legends Inc.  Maria Hernandez  2125558493
4       Microscale Inc.          Yu Choi  2125551957

6.	El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [34]:
query = "SELECT productCode AS Código, productName as Nombre FROM products WHERE productVendor = 'Gearbox Collectibles' AND quantityInStock > 1000 "
pd.read_sql(query,db)

     Código                                  Nombre
0  S18_1889             1948 Porsche 356-A Roadster
1  S18_2238          1998 Chrysler Plymouth Prowler
2  S18_3482                   1976 Ford Gran Torino
3  S18_3685          1948 Porsche Type 356 Roadster
4  S24_3432                     2002 Chevy Corvette
5  S32_2206                       1982 Ducati 996 R
6  S32_3207  1950's Chicago Surface Lines Streetcar

7.	Los tres productos más caros, desde el punto de visto de los comercializadores (`buyPrice`).

In [35]:
query = "SELECT productCode AS Código, productName AS Nombre, productDescription AS Descripción, buyPrice AS Precio FROM products ORDER BY buyPrice DESC LIMIT 3"
pd.read_sql(query,db)

,Código,Nombre,Descripción,Precio
0,S10_4962,1962 LanciaA Delta 16V,Features include: Turnable front wheels; steer...,103.42
1,S18_2238,1998 Chrysler Plymouth Prowler,Turnable front wheels; steering function; deta...,101.51
2,S10_1949,1952 Alpine Renault 1300,Turnable front wheels; steering function; deta...,98.58

8.	La cantidad de productos por línea de producto (no las existencias en inventario)

In [36]:
query = "SELECT productLine AS Lineas_d_Producto, COUNT(productCode) AS Cantidad_productos, SUM(quantityInStock) AS Inventario FROM products GROUP BY productLine ORDER BY Cantidad_productos DESC"
pd.read_sql(query,db)

  Lineas_d_Producto  Cantidad_productos  Inventario
0      Classic Cars                  38    219183.0
1      Vintage Cars                  24    124880.0
2       Motorcycles                  13     69401.0
3            Planes                  12     62287.0
4  Trucks and Buses                  11     35851.0
5             Ships                   9     26833.0
6            Trains                   3     16696.0

9.	La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [37]:
query = """SELECT f.country AS País, COUNT(e.employeeNumber) AS Empleados FROM employees e
LEFT JOIN offices f on f.officeCode = e.officeCode
GROUP BY f.country
ORDER BY Empleados DESC"""


pd.read_sql(query,db)

        País  Empleados
0        USA         10
1     France          5
2  Australia          4
3         UK          2
4      Japan          2

10.	El promedio de los pagos de cada uno de los clientes de España.

In [38]:
query = """SELECT c.customerName AS Clientes, ROUND(COALESCE(AVG(p.amount), 0), 2) AS Promedio_Pago FROM customers c
LEFT JOIN payments p on p.customerNumber = c.customerNumber
WHERE c.country = 'Spain'
GROUP BY c.customerName
ORDER BY Promedio_Pago DESC

"""

pd.read_sql(query,db)

                     Clientes  Promedio_Pago
0      Euro+ Shopping Channel       55056.84
1  Corrida Auto Replicas, Ltd       37480.03
2  Iberia Gift Imports, Corp.       25493.93
3                 CAF Imports       23375.57
4          Enaco Distributors       22840.16
5         Anton Designs, Ltd.           0.00
6               ANG Resellers           0.00

# **Parte 2**. Manipulación de datos con Pandas

11.	Carga las tablas empleadas en dataframes con el mismo nombre y resuelve las consultas anteriores con las funciones de Pandas. Cuida no sobreescribir los dataframes originales al resolver las consultas. Debes obtener los mismos resultados que con SQL.

In [39]:

#Queries de cada una de las tablas
querypl = "SELECT * FROM productlines"
querypr = "SELECT * FROM products"
queryordet = "SELECT * FROM orderdetails"
queryders = "SELECT * FROM orders"
querycus = "SELECT * FROM customers"
queryem = "SELECT * FROM employees"
queryoff = "SELECT * FROM offices"
querypay = "SELECT * FROM payments"

#Asiganación a un DF cada una de las tablas
productlines = pd.read_sql(querypl,db)
products = pd.read_sql(querypr,db)
orderdetails = pd.read_sql(queryordet,db)
orders = pd.read_sql(queryders,db)
customers = pd.read_sql(querycus,db)
employees = pd.read_sql(queryem,db)
offices = pd.read_sql(queryoff,db)
payments = pd.read_sql(querypay,db)

1. La información de las líneas de productos:

In [40]:
df1 = productlines[['productLine', 'textDescription']].rename(columns={'productlines': 'Líneas_d_producto', 'textDescription': 'Description'})
df1

        productLine                                        Description
0      Classic Cars  Attention car enthusiasts: Make your wildest c...
1       Motorcycles  Our motorcycles are state of the art replicas ...
2            Planes  Unique, diecast airplane and helicopter replic...
3             Ships  The perfect holiday or anniversary gift for ex...
4            Trains  Model trains are a rewarding hobby for enthusi...
5  Trucks and Buses  The Truck and Bus models are realistic replica...
6      Vintage Cars  Our Vintage Car models realistically portray a...

2. Los empleados ordenados por nombre (firstName)

In [41]:
df2 = employees.assign(Nombre=employees['firstName'] + ' ' + employees['lastName']).sort_values(by='firstName')
df2 = df2[['Nombre', 'jobTitle', 'employeeNumber']].rename(columns={'jobTitle': 'Puesto', 'employeeNumber': 'Número_empleado'})
df2=df2.reset_index(drop=True)
df2

               Nombre                Puesto  Número_empleado
0         Andy Fixter             Sales Rep             1611
1         Anthony Bow    Sales Manager (NA)             1143
2         Barry Jones             Sales Rep             1504
3        Diane Murphy             President             1002
4      Foon Yue Tseng             Sales Rep             1286
5       George Vanauf             Sales Rep             1323
6    Gerard Hernandez             Sales Rep             1370
7       Gerard Bondur   Sale Manager (EMEA)             1102
8       Jeff Firrelli          VP Marketing             1076
9      Julie Firrelli             Sales Rep             1188
10         Larry Bott             Sales Rep             1501
11    Leslie Jennings             Sales Rep             1165
12    Leslie Thompson             Sales Rep             1166
13        Loui Bondur             Sales Rep             1337
14         Mami Nishi             Sales Rep             1621
15      Martin Gerard             Sales Rep             1702
16     Mary Patterson              VP Sales             1056
17    Pamela Castillo             Sales Rep             1401
18        Peter Marsh             Sales Rep             1612
19    Steve Patterson             Sales Rep             1216
20           Tom King             Sales Rep             1619
21  William Patterson  Sales Manager (APAC)             1088
22       Yoshimi Kato             Sales Rep             1625

3. Los Países donde hay oficinas.

In [42]:
df3 = offices.groupby('country')['officeCode'].count().reset_index().rename(columns={'country': 'País', 'officeCode': 'Oficinas'}).sort_values(by='Oficinas', ascending=False).reset_index(drop=True)
df3

        País  Oficinas
0        USA         3
1  Australia         1
2     France         1
3      Japan         1
4         UK         1

4. EL nombre y teléfono de los clientes de la ciudad de Nueva York.

In [43]:
df4 =customers.assign(Contacto=customers['contactFirstName'] + ' ' + customers['contactLastName'])
df4 = df4[['customerName', 'Contacto', 'phone', 'city']].rename(columns={'customerName': 'Cliente', 'phone': 'Teléfono'}).reset_index(drop=True)
df4 = df4[(df4['city'] == 'NYC')]
df4= df4.drop(columns='city', axis=1).reset_index(drop=True)
df4

                Cliente         Contacto    Teléfono
0     Land of Toys Inc.         Kwai Lee  2125557818
1    Muscle Machine Inc       Jeff Young  2125557413
2       Vitachrome Inc.    Michael Frick  2125551500
3  Classic Legends Inc.  Maria Hernandez  2125558493
4       Microscale Inc.          Yu Choi  2125551957

5. El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [44]:
df5 = products[(products['productVendor'] == 'Gearbox Collectibles') & (products['quantityInStock'] > 1000) ].reset_index(drop=True)
df5 = df5[['productCode', 'productName']].rename(columns={'productCode': 'Código', 'productName': 'Nombre'})
df5

     Código                                  Nombre
0  S18_1889             1948 Porsche 356-A Roadster
1  S18_2238          1998 Chrysler Plymouth Prowler
2  S18_3482                   1976 Ford Gran Torino
3  S18_3685          1948 Porsche Type 356 Roadster
4  S24_3432                     2002 Chevy Corvette
5  S32_2206                       1982 Ducati 996 R
6  S32_3207  1950's Chicago Surface Lines Streetcar

6. Los tres Productos más caros, desde el punto de vista de los comercializadores (*buyPrice*)

In [45]:
df6 = products.sort_values(by='buyPrice', ascending=False).head(3).reset_index(drop=True)

df6 = df6[['productCode', 'productName','productDescription', 'buyPrice']].rename(columns={'productCode': 'Código', 'productName': 'Nombre', 'productDescription': 'Descripción', 'buyPrice': 'Precio'})
df6

,Código,Nombre,Descripción,Precio
0,S10_4962,1962 LanciaA Delta 16V,Features include: Turnable front wheels; steer...,103.42
1,S18_2238,1998 Chrysler Plymouth Prowler,Turnable front wheels; steering function; deta...,101.51
2,S10_1949,1952 Alpine Renault 1300,Turnable front wheels; steering function; deta...,98.58

7. La cantidad de productos por línea de producto (no las existencias en inventario).

In [46]:
df7 = products.groupby('productLine').agg({'productCode': 'count', 'quantityInStock': 'sum'}).reset_index().rename(columns={'productLine': 'Producto', 'productCode': 'Cantidad_Productos', 'quantityInStock': 'Inventario'}).sort_values(by='Cantidad_Productos', ascending=False).reset_index(drop=True)

df7

           Producto  Cantidad_Productos  Inventario
0      Classic Cars                  38      219183
1      Vintage Cars                  24      124880
2       Motorcycles                  13       69401
3            Planes                  12       62287
4  Trucks and Buses                  11       35851
5             Ships                   9       26833
6            Trains                   3       16696

8. La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [47]:
df8 = pd.merge(employees,offices,on = 'officeCode')
df8 = df8.groupby('country')['employeeNumber'].count().reset_index()
df8 = df8.rename(columns={'country': 'País', 'employeeNumber': 'Empleados'}).sort_values(by='Empleados', ascending=False).reset_index(drop=True)
df8

        País  Empleados
0        USA         10
1     France          5
2  Australia          4
3      Japan          2
4         UK          2

9. El promedio de los pagos de cada uno de los clientes de España.

In [48]:
df9 = pd.merge(customers[customers['country'] == 'Spain'], payments, on = 'customerNumber', how= 'left')
df9 = df9.groupby('customerName')['amount'].mean().reset_index()
df9['amount'] = df9['amount'].fillna(0)  
df9 = df9.rename(columns={'customerName': 'Cliente', 'amount': 'Promedio_pago'}).round(2).sort_values(by='Promedio_pago',ascending=False).reset_index(drop=True)

df9

                      Cliente  Promedio_pago
0      Euro+ Shopping Channel       55056.84
1  Corrida Auto Replicas, Ltd       37480.03
2  Iberia Gift Imports, Corp.       25493.93
3                 CAF Imports       23375.57
4          Enaco Distributors       22840.16
5               ANG Resellers           0.00
6         Anton Designs, Ltd.           0.00

# **Parte 3**. Cliente de Python Firestore

En esta fase te conectarás a una base de datos no relacional de Firestore desde Python. Para ello utilizarás los módulos `credentials` y `firestore` de la biblioteca `firebase_admin`.

In [49]:
import firebase_admin
from firebase_admin import credentials
from firebase_admin import firestore
import pandas as pd

El archivo `veterinary.json` almacena la clave privada para autenticar una cuenta y autorizar el acceso a los servicios de Firebase. A través de la función `Certificate()`, se regresa una credencial inicializada, que puedes utilizar para crear una nueva instancia de la aplicación. Después de eso, tu conexión a Firestore utilizará las reglas de seguridad establecidas para la base de datos y el usuario autenticado.

In [50]:
cred = credentials.Certificate('veterinary.json')
firebase_admin.initialize_app(cred)
db = firestore.client()

12.	Investiga cómo leer la colección `PET_OWNER` y mostrar su contenido en un dataframe. Asegúrate de incluir el id en el resultado

In [51]:
coleccion = "PET_OWNER"
coleccion_ref = db.collection(coleccion)
documentos = coleccion_ref.stream()
data = []
document_ids = []

for documento in documentos:
    document_data = documento.to_dict()
    document_data['_id'] = documento.id 
    data.append(document_data)
    document_ids.append(documento.id)


df_pet_owner_id = pd.DataFrame(data)


df_pet_owner_id['_id'] = document_ids

df_pet_owner_id = df_pet_owner_id[['ownerFirstName', 'ownerLastName', '_id','email','phone']]

df_pet_owner_id = df_pet_owner_id.dropna(subset=['ownerFirstName'])
df_pet_owner_id = df_pet_owner_id.rename(columns={'ownerFirstName': 'Nombre', 'ownerLastName': 'Apellido', '_id': 'Id'})
df_pet_owner_id

,Nombre,Apellido,Id,email,phone
0,Sam,Taylor,0D6yFSs2eu4nYwf2dnQ0,None,555-454-3465
1,Miles,Trent,98357ufgjmWUxjnAuzbz,miles.trent@somewhere.com,None
2,Liz,Frier,AFtZincSZxjC4Mcxf9Pf,liz.frier@somewhere.com,555-537-6543
3,Jenny,Mayberry,GYDixDwHjMyihjL8TmsM,None,555-454-1243
4,Marsha,Downs,IpxTuB6FILhwQFcspLws,'marcha.downs@somewhere.com,555-537-8765
5,Ken,Roberts,QoXBfS1JdRp6BqgLzaAz,None,555-454-2354
7,Nigel,Melnik,eUtZ44lPRbSHXX04EDp7,nigel.melnik@somewhere.com,555-232-5678
8,Richard,James,n2GG9rlfGOmE0P4TcU0T,richard.james@somewhere.com,555-537-7654
9,Jim,Rogers,pDlJlul8EJXO8FBJvFkN,jim.rogers@somewhere.com,555-232-3456
10,Mary,Keenan,tAlJ74xQ7tT4TUHwZgmH,mary.keenan@somewhere.com,555-232-4567

In [52]:
firebase_admin.delete_app(firebase_admin.get_app())